app/Controllers/Admin/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'admin@123.com'
 LIMIT 1
---
    public function authenticate()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'email' => 'required|valid_email',
            'password' => 'required'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->with('errors', $validation->getErrors())->withInput();
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Pastikan email dan password adalah string sebelum melanjutkan
        if (!is_string($email) || !is_string($password)) {
            return redirect()->back()->with('errors', ['Invalid credentials'])->withInput();
        }

        // Authentication logic here (example with a User model)
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();