app/Controllers/Admin/ProdukController.php

SELECT *
FROM `produk`
---
    public function index()
    {
        $data['produk'] = $this->productModel->findAll();