app/Controllers/Cart.php

SELECT *
FROM `produk`
WHERE `produk`.`id` = '14'
---
    public function checkout($productId)
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Please login to proceed checkout.');
        }

         // Load product details
         $produkModel = new ProdukModel();
         $product = $produkModel->find($productId);

INSERT INTO `checkout` (`user_id`, `product_id`, `shipping_address`, `payment_method`, `payment_proof`, `payment_status`) VALUES ('4', '14', 'kota malang', 'Credit Card', '1718728552_27068856c275f72c8b0d.png', 'Pending')
---
    public function processPayment()
    {
        // Validate user authentication
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Please login to proceed payment.');
        }

        // Load the model
        $checkoutModel = new CheckoutModel();

        // Get data from POST request
        $productId = $this->request->getPost('product_id');
        $shippingAddress = $this->request->getPost('shipping_address');
        $paymentMethod = $this->request->getPost('payment_method');
        $paymentProof = $this->request->getFile('payment_proof');

        // Simpan bukti pembayaran ke server
        $paymentProofName = $paymentProof->getRandomName();
        $paymentProof->move(ROOTPATH . 'public/uploads/payment_proof', $paymentProofName);

        // Simpan informasi checkout ke dalam database
        $checkoutData = [
            'user_id' => session()->get('id'),
            'product_id' => $productId,
            'shipping_address' => $shippingAddress,
            'payment_method' => $paymentMethod,
            'payment_proof' => $paymentProofName,
            'payment_status' => 'Pending'
        ];

        $checkoutModel->insert($checkoutData);