app/Controllers/Home.php

    public function landing()
    {
        $data['produk'] = $this->productModel->findAll();
---
SELECT *
FROM `produk`

    public function index(): string
    {
        $data['produk'] = $this->productModel->findAll();
---
SELECT *
FROM `produk`