app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'miftikharul@gmail.com'
 LIMIT 1
---
    public function authenticate()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'email' => 'required|valid_email',
            'password' => 'required'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $users = new UserModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $users->where('email', $email)->first();